function point2_fk(θ)
    x = -0.1sin(θ[1])*cos(θ[2])
    y = 0.08 + 0.1sin(θ[2])
    z = -0.1cos(θ[1])*cos(θ[2])
    return [x, y, z]
end

function point3_fk(θ)
    x = -0.3035sin(θ[1])*cos(θ[2])
    y =  0.08 + 0.3035sin(θ[2])
    z =  -0.3035cos(θ[1])*cos(θ[2])
    return [x, y, z]
end

function point4_fk(θ)
    x = 0.1sin(θ[1])*sin(θ[2])*sin(θ[3]) - 0.40349999999999997sin(θ[1])*cos(θ[2]) - 0.1sin(θ[1])*cos(θ[2])*cos(θ[3])
    y = 0.08 + 0.40349999999999997sin(θ[2]) + 0.1sin(θ[2])*cos(θ[3]) + 0.1cos(θ[2])*sin(θ[3])
    z = 0.1cos(θ[1])*sin(θ[2])*sin(θ[3]) - 0.40349999999999997cos(θ[1])*cos(θ[2]) - 0.1cos(θ[1])*cos(θ[2])*cos(θ[3])
    return [x, y, z]
end

function point5_fk(θ)
    x = 0.30000000000000004sin(θ[1])*sin(θ[2])*sin(θ[3]) - 0.40349999999999997sin(θ[1])*cos(θ[2]) - 0.30000000000000004sin(θ[1])*cos(θ[2])*cos(θ[3])
    y = 0.08 + 0.40349999999999997sin(θ[2]) + 0.30000000000000004sin(θ[2])*cos(θ[3]) + 0.30000000000000004cos(θ[2])*sin(θ[3])
    z = 0.30000000000000004cos(θ[1])*sin(θ[2])*sin(θ[3]) - 0.40349999999999997cos(θ[1])*cos(θ[2]) - 0.30000000000000004cos(θ[1])*cos(θ[2])*cos(θ[3])
    return [x, y, z]
end

function point6_fk(θ)
    x = 0.07((sin(θ[1])*sin(θ[2])*cos(θ[3]) + sin(θ[1])*cos(θ[2])*sin(θ[3]))*sin(θ[4]) + cos(θ[1])*cos(θ[4]))*(9.63268e-5cos(θ[5]) - sin(θ[5])) + 0.07(-cos(θ[5]) - 9.63268e-5sin(θ[5]))*(sin(θ[1])*cos(θ[2])*cos(θ[3]) - sin(θ[1])*sin(θ[2])*sin(θ[3])) + 0.42500000000000004sin(θ[1])*sin(θ[2])*sin(θ[3]) - 0.40349999999999997sin(θ[1])*cos(θ[2]) - 0.42500000000000004sin(θ[1])*cos(θ[2])*cos(θ[3])

    y = 0.08 + 0.40349999999999997sin(θ[2]) + 0.42500000000000004sin(θ[2])*cos(θ[3]) + 0.42500000000000004cos(θ[2])*sin(θ[3]) + 0.07(cos(θ[2])*cos(θ[3]) - sin(θ[2])*sin(θ[3]))*(9.63268e-5cos(θ[5]) - sin(θ[5]))*sin(θ[4]) - 0.07(-cos(θ[5]) - 9.63268e-5sin(θ[5]))*(sin(θ[2])*cos(θ[3]) + cos(θ[2])*sin(θ[3]))

    z = 0.07(-cos(θ[5]) - 9.63268e-5sin(θ[5]))*(cos(θ[1])*cos(θ[2])*cos(θ[3]) - cos(θ[1])*sin(θ[2])*sin(θ[3])) + 0.07(9.63268e-5cos(θ[5]) - sin(θ[5]))*((cos(θ[1])*cos(θ[2])*sin(θ[3]) + cos(θ[1])*sin(θ[2])*cos(θ[3]))*sin(θ[4]) - sin(θ[1])*cos(θ[4])) + 0.42500000000000004cos(θ[1])*sin(θ[2])*sin(θ[3]) - 0.40349999999999997cos(θ[1])*cos(θ[2]) - 0.42500000000000004cos(θ[1])*cos(θ[2])*cos(θ[3])
    
    return [x, y, z]
end

function point7_fk(θ)
    x = 0.12125((sin(θ[1])*sin(θ[2])*cos(θ[3]) + sin(θ[1])*cos(θ[2])*sin(θ[3]))*sin(θ[4]) + cos(θ[1])*cos(θ[4]))*(9.63268e-5cos(θ[5]) - sin(θ[5])) + 0.12125(-cos(θ[5]) - 9.63268e-5sin(θ[5]))*(sin(θ[1])*cos(θ[2])*cos(θ[3]) - sin(θ[1])*sin(θ[2])*sin(θ[3])) + 0.42500000000000004sin(θ[1])*sin(θ[2])*sin(θ[3]) - 0.40349999999999997sin(θ[1])*cos(θ[2]) - 0.42500000000000004sin(θ[1])*cos(θ[2])*cos(θ[3])

    y = 0.08 + 0.40349999999999997sin(θ[2]) + 0.42500000000000004sin(θ[2])*cos(θ[3]) + 0.42500000000000004cos(θ[2])*sin(θ[3]) + 0.12125(cos(θ[2])*cos(θ[3]) - sin(θ[2])*sin(θ[3]))*(9.63268e-5cos(θ[5]) - sin(θ[5]))*sin(θ[4]) - 0.12125(-cos(θ[5]) - 9.63268e-5sin(θ[5]))*(sin(θ[2])*cos(θ[3]) + cos(θ[2])*sin(θ[3]))

    z = 0.12125(-cos(θ[5]) - 9.63268e-5sin(θ[5]))*(cos(θ[1])*cos(θ[2])*cos(θ[3]) - cos(θ[1])*sin(θ[2])*sin(θ[3])) + 0.12125(9.63268e-5cos(θ[5]) - sin(θ[5]))*((cos(θ[1])*cos(θ[2])*sin(θ[3]) + cos(θ[1])*sin(θ[2])*cos(θ[3]))*sin(θ[4]) - sin(θ[1])*cos(θ[4])) + 0.42500000000000004cos(θ[1])*sin(θ[2])*sin(θ[3]) - 0.40349999999999997cos(θ[1])*cos(θ[2]) - 0.42500000000000004cos(θ[1])*cos(θ[2])*cos(θ[3])
    
    return [x, y, z]
end