function link7_fk(θ)
    x = 0.12125((sin(θ[1])*sin(θ[2])*cos(θ[3]) + sin(θ[1])*cos(θ[2])*sin(θ[3]))*sin(θ[4]) + cos(θ[1])*cos(θ[4]))*(9.63268e-5cos(θ[5]) - sin(θ[5])) + 0.12125(-cos(θ[5]) - 9.63268e-5sin(θ[5]))*(sin(θ[1])*cos(θ[2])*cos(θ[3]) - sin(θ[1])*sin(θ[2])*sin(θ[3])) + 0.42500000000000004sin(θ[1])*sin(θ[2])*sin(θ[3]) - 0.40349999999999997sin(θ[1])*cos(θ[2]) - 0.42500000000000004sin(θ[1])*cos(θ[2])*cos(θ[3])

    y = 0.08 + 0.40349999999999997sin(θ[2]) + 0.42500000000000004sin(θ[2])*cos(θ[3]) + 0.42500000000000004cos(θ[2])*sin(θ[3]) + 0.12125(cos(θ[2])*cos(θ[3]) - sin(θ[2])*sin(θ[3]))*(9.63268e-5cos(θ[5]) - sin(θ[5]))*sin(θ[4]) - 0.12125(-cos(θ[5]) - 9.63268e-5sin(θ[5]))*(sin(θ[2])*cos(θ[3]) + cos(θ[2])*sin(θ[3]))

    z = 0.12125(-cos(θ[5]) - 9.63268e-5sin(θ[5]))*(cos(θ[1])*cos(θ[2])*cos(θ[3]) - cos(θ[1])*sin(θ[2])*sin(θ[3])) + 0.12125(9.63268e-5cos(θ[5]) - sin(θ[5]))*((cos(θ[1])*cos(θ[2])*sin(θ[3]) + cos(θ[1])*sin(θ[2])*cos(θ[3]))*sin(θ[4]) - sin(θ[1])*cos(θ[4])) + 0.42500000000000004cos(θ[1])*sin(θ[2])*sin(θ[3]) - 0.40349999999999997cos(θ[1])*cos(θ[2]) - 0.42500000000000004cos(θ[1])*cos(θ[2])*cos(θ[3])

    return (x, y, z)
end